# საკლასო დავალება - მასალის გამეორება:

# 1. შექმენით ფუნქცია, რომელიც მიიღებს მთელი რიცხვების სიას. შემდეგ ამ სიაზე მოახდენს მუშაობს და დატოვებს მასში მხოლოდ ლუწ რიცხვებს. საბოლოოდ უნდა დააბრუნოთ უკვე მხოლოდ ლუწ რიცხვებიანი სია.
# 2. შექმენით ფუნქცია, რომელიც მიიღებს სიას, სადაც იქნება რამდენიმე string. ფუნქციამ უნდა იმუშაოს ამ სიაზე, მასში დატოვოს მხოლოდ ისეთი string-ები, რომელთა სიგრძე ნაკლებია ან ტოლია 4-ის. უკვე გარდაქმნილი სია კი უნდა დააბრუნოს ფუნქციამ return-ის გამოყენებით.
# 3. შექმენით ფუნქცია რომელიც მიიღებს სიას, ამ სიაში შეიძლება გვქონდეს მთელი რიცხვები და ათწილადები, თქვენი დავალებაა რომ დააბრუნოთ ახალი სია რომელშიც იქნება მხოლოდ მთელი რიცხვები.