# 1) შექმენით for ციკლი რომლის გამოყენებითაც გაიგებთ 0დან 10ის ჩათვლით ლუწ რიცხვებს და შემდეგ იპოვის ამ ლუწი რიცხვების ჯამს
# 2) შექმენით for ციკლი რომლის გამოყენებითაც გაიგებთ 0დან 10ის ცათვლით კენტ რიცხვებს და შემდეგ იპოვის ამ კენტი რიცხვების ჯამს
# 3) შექმენით for ციკლი რომლის გამოყენებითაც გაიგებთ ყველა 5ის ჯერად რიცხვს 0იდან 100ის ჩათვლით და შემდეგ გამოიტანთ ამ 5ის ჯერადი რიცხვების ჯამს
# 4) შექმენით for ციკლი რომლის გამოყენებითაც გაიგებთ ყველა 3ის ჯერად რიცხვს 0იდან 100ის ჩათვლით 
# 5) for ციკლის მეშვეობით დაპრინტეთ ყველა რიცხვი 20იდან 0ის ჩათვლით(უკუღმა)
# 6) მომხმარებელს შემოატანინეთ ორი რიცხვი. ამის შემდეგ კი for loop ის მეშვეობით იპოვეთ ყველა რიცხვი ამ ორ რიცხვს შორის, შემდეგ გამოთვალეთ ამ რიცხვების ჯამი და საბოლოოდ კი დაპრინტეთ ტერმინალში
# 1) შექმენით while ციკლი რომლის გამოყენებითაც გაიგებთ 0დან 10ის ჩათვლით ლუწ რიცხვებს და შემდეგ იპოვის ამ ლუწი რიცხვების ჯამს
# 2) შექმენით while ციკლი რომლის გამოყენებითაც გაიგებთ 0დან 10ის ცათვლით კენტ რიცხვებს და შემდეგ იპოვის ამ კენტი რიცხვების ჯამს
# 3) შექმენით while ციკლი რომლის გამოყენებითაც გაიგებთ ყველა 5ის ჯერად რიცხვს 0იდან 100ის ჩათვლით და შემდეგ გამოიტანთ ამ 5ის ჯერადი რიცხვების ჯამს
# 4) შექმენით while ციკლი რომლის გამოყენებითაც გაიგებთ ყველა 3ის ჯერად რიცხვს 0იდან 100ის ჩათვლით 
# 5) while ციკლის მეშვეობით დაპრინტეთ ყველა რიცხვი 20იდან 0ის ჩათვლით(უკუღმა)
# 6) while loop-ის მეშვეობით მომხმარებელს იქამდე შემოატანინეთ სწორი პაროლი სანამ ეს პაროლი არ იქნება სოწი