# 1) შექმენით ფორმა სადაც გექნებათ 3შესატანი ველი იმეილი პაროლი და ფაილი. პირველი ორი იქნება აუცილებელი ხოლო მესამე ჩვეულებრივი

# 2) თითოეული სვეტისთვის შექმენით შესატანი ველი სადაც name ატრიბუტში მიუთითებთ შესაბამის სახელს. კომენტარებიტ ახსენით რაში გამოიყენება name ატრიბუტი და რა არის მონაცემთა ბაზა

# 3) ეცადეთ რომ შექმნათ სარეგისტრაციო გვერდი დღეს ნასწავლი მასალის გამოყენებით. აუცილებლად უნდა იყოს იყოს სახელი გვარი იმელი პაროლი ასაკი და დაბადების თარიღი. ყველა მათგანი უნდა იყოს required

# 4) შექმენით შესატანი ველი სადაც მარტო შეგეძლებათ არჩევა. ან გადაიხდით ბარათით ან გადაიხდით ქეშით ან გადაიხდით კრიპტოთი

# 5) შექმენით ჩექბოქსები სადაც მომხმარებელს შეეძლება 5ჰობის არჩევა