#ჩვენ სემოგვაქ Def ფუნქცია რომელშიც გვაქ ჩაწერილი 2 ცვლადი და ოპერაცია
def add (num1, num2, operation):
#თუ დავალება იქნება + ოპერაციით მაშინ ის მიუმატებს
    if operation == "+":
        result1 = num1 + num2
#თუ დავალება იქნება - ოპერაციით მაშინ ის გამოვაკლებს
    elif operation == "-":
        result2 = num1 - num2 
#თუ დავალება გვექნება / ოპერაციით მაშინ ის გაყოფს
    elif operation == "/":
        result3 = num1 / num2
#თუ დავალება გვექნება * ოპერაციით მაშინ ის გამრავლდება
    elif operation == "*":
        result4 = num1 * num2
#თუ დავალება გვექნება = ოპერაციით მაშინ ის ტოლია
    elif operation == "=":
        result5 = num1 = num2
#თუ დავალებაში არ გვექნება ის ოპერაცია რომელიც ჩვენ გვაქ  მოცემული მაშინ ის დაგვიწერს Eror
    else:
        print("Eror")
    return result1
add(132, 413, "+")
add(531, 619, "-")
add(424, 735, "/")
add(931, 813, "*")
add(241, 241, "=")

