# 1) დაწერეთ bubble სორტის ალგორითმი
# 4) შევქმნათ გასტილული counter-ი
# 2) შექმენით ფუნქცია რომელსაც გადაეცემა ორი მასივი და დააბრუნებს მასივს მხოლოს იმ ელემენტებით რომლებიც ამ ორ მასივში არ ემთხვევა
# 5) შექმენით ტექსტი "გამრჯობა"-ს ელემენტი და ღილაკი რომელიც დაკლიკების დროს მას აქრობს და გაქრობამდე (transition) გადააკეთებს "ნახვამდის"- ტექსტად, შემდეგ დაკლიკებაზე ისევ "გამარჯობად" უნდა გადაკეთდეს და გაჩნდეს ( ღილაკმა უსასრულოდ უნდა იმუშავოს )
# 3) შექმენით ფუნქცია რომელსაც გადეცემა ორი მასივი და პირველი მასივიდან ამოიღებს მეორე მასივში მოცემულ ელემენტებს