# GIT არის ვრსიების კონტროლის სისტემა რომლითაც ჩვენ თვალს ვადევნებთ განახლებებს და წინა ვერსიებსვინახავთ ხოლო
# git hub-ი არის პლატფორმა ვებ-საიტი პროგრამისტებისთვის რომლის დახმარებითაც გამოაქვთ თავიანთი პროექტები საჯაროდ
# უზიარებენ ერთმანეთს პროექტებს ასევე git hub-ი ასრულებს საწყობის როლს ჩვენ ვინახავთ ცჰვენ პროექტებს git hub-ზე 
# და თუნდაც ის ფოლდერი წავშალოთ git hub-ზე მაინც დარჩება პროექტი 

# ჩნდება კითხვა თუ როგორ გამოვიყენოთ ჩვენს პროექტში ვერსიების კონტროლის სისტემა?

# 1. როდესაც პროექტი ახალი შექმნილია, პროექტში ვერსიების კონტროლის სისტემის დასაყენებლად ტერმინალში უნდა დავწეროთ 
# git init ეს სისტემა გამოიყენება მხოლოდ ერთხელ

# 2. ჩვენ რომ შევქმნათ ახალი ვერსია მანამდე საჭიროა ავირჩიოთ ის ფაილები რომელიც გვინდა რომ ახალ ვერსიაში მოთავსდეს და ამას 
# ვაკეთებთ git add . ამას ვაკეთებთ ყოველ განახლებაზე

# 3. ჩვენ რომ ახალი ვერსია შევქმნათ უნდა დავწეროთ ისევ ტერმინალში git commit -m "და რაც გვინდა რომ ვერსიას ერქვას მაგ:level22hw" 
# git commit ქმნის ახალ ვერსიას ხოლო -m გვაძლევს საშუალებას ტერმინალიდან ვერსიას დავარქვა სახელი"

# github ის რეპოზიტორიის დაკავშირება ჩვენს ფოლდერთან

# 1. ვქმნით რეპოზიტორიას github ზე
# 2. ტერმინალში ვწერთ ბოლო 3 ბრძანებას რომელიც ახალი რეპოზიტორიის შექმნის შემდეგ ამოგიგცდოთ
# git add .
# git commit -m "commit"
# git push 