# 1)აიღეთ ორი div და ჩაწერეთ შიგნით ტექტსი დამატებით ეს div ბლოკი გასტილეთ კუთვნილებებით: background-color, border, შემდეგ ამ div ბლოკებს გაუწერეთ padding და margin


# (კომენტარებით ახსენით ყველაფერ! + ახსენით css box model)

# შექმენით div ბლოკი პარაგრაფით, გაუწერეთ padding-ისა margin-ის 4-ივე არგუმენტი სხვადასხვა ზომით და დააკომენტარეთ, შემდეგ ამ კუთვნილებების (padding,margin) კონკრეტული მხარეების მითითებით გაუწერეთ იგივე ზომები რაც ეწერა თავდაპირველად (მაგალითად: padding: 12px 5px - padding-top: 12px; padding-right: 5px;). ყველაფერი ახსენით კომენტარებით
# თქვენი სიტყვებით ახსენით რა განსხვავებაა padding-ისა და margin-ს შორის
# აიღეთ 1 მშობელი container div-ი, რომელშიც გექნებათ 3 შვილი div, მშობელ ელემენტზე გამოიყენეთ flex განლაგება და განალაგეთ შვილი ელემენტები ჰორიზონტალურად
# შექმენით მეორე მშობელი div და მისი 3 შვილი div განალაგეთ ვერტიკალურად, flex-ისა და flex-direction column-ის საშვალებით