# ---

# 1. **შექმენით ფუნქცია: "გადავიდეთ თუ არა ტესტში"**  
# ფუნქციას გადაეცით შეფასებები და დამწერები. ტესტის ჩაბარება მოხდება თუ ერთ-ერთი მათგანი აკმაყოფილებს მოთხოვნებს.

# 2. **შექმენით ფუნქცია: "შეგვიძლია თუ არა გასვლა გარეთ"**  
# საჭიროა ამინდი იყოს კარგი ან დრო საკმარისი იყოს, და ჩვენ მზად ვიყოთ გასასვლელად.

# 3. **შექმენით ფუნქცია: "გადავდგათ თუ არა ნაბიჯი"**  
# # საჭიროა ბარიერი არ იყოს და წასასვლელი სივრცე ხელმისაწვდომი იყოს, ან მეორე მხარეს სიგნალი მოდიოდეს.

# 4. **შექმენით ფუნქცია: "უნდა ავიღოთ თუ არა ნივთი"**  
# საჭიროა ნივთი ხელმისაწვდომი იყოს და მისი წაღება დასაშვები იყოს, ან სხვა ადამიანს არ სურდეს მისი გამოყენება.

# 5. **შექმენით ფუნქცია: "უნდა გავიხსენოთ თუ არა ინფორმაცია"**  
# საჭიროა დავალება იყოს აქტუალური ან ინფორმაცია ჯერ კიდევ საჭირო იყოს, და დრო გვქონდეს მის დასამუშავებლად.

# 6. **შექმენით ფუნქცია: "უნდა დავიძინოთ თუ არა"**  
# საჭიროა დრო იყოს გვიანი და ადამიანი დაღლილი იყოს, ან მეორე დღეს ადრიანად ადგომა საჭირო იყოს და შუქი გამორთული იყოს.

# 7. **შექმენით ფუნქცია: "უნდა წავიდეთ თუ არა წვეულებაზე"**  
# საჭიროა მეგობრები თანახმა იყვნენ წასვლაზე და მეორე დღეს სამუშაო არ იყოს, ან წვეულება ახლოს ტარდებოდეს.

# 8. **შექმენით ფუნქცია: "უნდა დავრჩეთ თუ არა სახლში"**  
# საჭიროა ამინდი იყოს წვიმიანი ან თოვლიანი, და გეგმები არ არსებობდეს, რომელიც გარეთ გასვლას საჭიროებს.

# 9. **შექმენით ფუნქცია: "უნდა გავიდეთ სირბილზე თუ არა"**  
# საჭიროა ამინდი იყოს მშრალი და სპორტული ფეხსაცმელი ხელმისაწვდომი იყოს, ან მეგობარი მზად იყოს სირბილისთვის.

# 10. **შექმენით ფუნქცია: "უნდა ვუყუროთ თუ არა ფეხბურთს"**  
# საჭიროა დღე იყოს შაბათი ან კვირა და სხვა საქმეები არ გვქონდეს, ან თამაში ჩვენი საყვარელი გუნდის იყოს.     ( ყველაზე კარგი ვარიანტია თუ შექმნით თითოეულისთვის ფუნქციას შესაბამისი რაოდენობის არგუმენტებით და ამ პრინციპით დაწერთ )